#=================================================================================================
#                            2.6.1
#=================================================================================================

''' Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел
не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.

Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно.

В примере мы считываем числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю
и выводим сумму их квадратов, не обращая внимания на то, что остались ещё не прочитанные значения.
'''
def f261 ():
    a = [int(input())]
    i = 0
    s = a[i]
    while s != 0:
        i += 1
        a.append(int(input()))
        s += a[i]
    p = 0
    l = len (a)
    for i in range(l):
        p += a[i]**2
    print (p)
    return 0

#=================================================================================================
#                            2.6.2
#=================================================================================================

''' Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... (число 
повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n — столько элементов 
последовательности должна отобразить программа. На выходе ожидается последовательность чисел, записанных через пробел 
в одну строку.

Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
'''
def f262 ():
    n = int(input())
    i,j = 0,0
    while i < n:
        j += 1
        x,k = j,1
        while x >= k:
            k += 1
            i += 1
            print (x,end=' ')
            if i == n:
                break
    return 0

#=================================================================================================
#                            2.6.3
#=================================================================================================

''' Напишите программу, которая считывает список чисел lst lst lst из первой строки и число x x x из второй строки, 
которая выводит все позиции, на которых встречается число x x x в переданном списке lst lst lst.

Позиции нумеруются с нуля, если число x x x не встречается в списке, вывести строку "Отсутствует" (без кавычек, 
с большой буквы).

Позиции должны быть выведены в одну строку, по возрастанию абсолютного значения.
'''
def f263 ():
    st = [int(i) for i in input().split()]
    x = int(input())
    k,e = 0,0
    for i in st:
        if i == x:
            print (k,end=' ')
            e += 1
        k += 1
    if e == 0:
        print('Отсутствует')
    return 0

#=================================================================================================
#                            2.6.4
#=================================================================================================

''' Напишите программу, на вход которой подаётся прямоугольная матрица в виде последовательности строк, 
заканчивающихся строкой, содержащей только строку "end" (без кавычек)

Программа должна вывести матрицу того же размера, у которой каждый элемент в позиции i, j равен сумме элементов 
первой матрицы на позициях (i-1, j), (i+1, j), (i, j-1), (i, j+1). У крайних символов соседний элемент находится 
с противоположной стороны матрицы.

В случае одной строки/столбца элемент сам себе является соседом по соответствующему направлению.
'''

def f264 ():
    j = 0
    k = 0
    a = []
    while j>=0:
        st = [i for i in input().split()]
        if st[0] == 'end':
            j = -1
        else:
            st = [int(i) for i in st]
            a.append(st)
            j += 1
    n = len(a)
    k = len(a[0])
    b = []
    for i in range (n):
        c = []
        for j in range (k):
            x1 = i-1
            x2 = i+1
            y1 = j-1
            y2 = j+1
            if i == 0:
                x1 = n-1
            if i == n-1:
                x2 = 0
            if j == 0:
                y1 = k-1
            if j == k-1:
                y2 = 0
            c += [a[x1][j]+a[x2][j]+a[i][y1]+a[i][y2]]
            print (c[j],end=' ')
        b.append (c)
        print ()
    return 0

#=================================================================================================
#                            2.6.5
#=================================================================================================

''' Выведите таблицу размером n×n, заполненную числами от 1 до n^2 по спирали, выходящей из левого верхнего угла 
и закрученной по часовой стрелке, как показано в примере (здесь n=5)

Sample Input:
5

Sample Output:
1 2 3 4 5
16 17 18 19 6
15 24 25 20 7
14 23 22 21 8
13 12 11 10 9
'''
def gonext (a,b):
    b += 1
    if b == len(a):
        b = 0
    return b

def f265 ():
    n = int(input('Введите размер таблицы n*n : '))
#    n = int(input())
    ar = [[0]*n for i in range(n)]
#    print(ar)
    cl = n**2
    c,i,j = 1,0,0
    di = ['right','down','left','up']
    idi = 0
    ar[i][j] = c
    while c<cl:
        st = 0
        while st == 0:
            if di[idi] == 'right':
                if j == n-1:
                    idi = gonext(di,idi)
                else:
                    j += 1
                    if ar[i][j] != 0:
                        idi = gonext(di,idi)
                        j -= 1
                    else:
                        st = 1
            if di[idi] == 'left':
                if j == 0:
                    idi = gonext(di,idi)
                else:
                    j -= 1
                    if ar[i][j] != 0:
                        idi = gonext(di,idi)
                        j += 1
                    else:
                        st = 1
            if di[idi] == 'down':
                if i == n-1:
                    idi = gonext(di,idi)
                else:
                    i += 1
                    if ar[i][j] != 0:
                        idi = gonext(di,idi)
                        i -= 1
                    else:
                        st = 1
            if di[idi] == 'up':
                if i == 0:
                    idi = gonext(di,idi)
                else:
                    i -= 1
                    if ar[i][j] != 0:
                        idi = gonext(di,idi)
                        i += 1
                    else:
                        st = 1
        c += 1
        ar[i][j] = c
    for i in range(n):
        for j in range(n):
            if ar[i][j]<10:
                print('',ar[i][j],end=' ')
            else:
                print(ar[i][j],end=' ')
        print()

    return 0

#===== поворот матрицы против часовой стрелки ======
'''
for j in range(n-1, -1, -1):
    for i in ar:
        print(i[j], end=" ")
    print()
'''

#=================================================================================================
#                            3.1.1
#=================================================================================================
''' Напишите функцию f(x), которая возвращает значение следующей функции, определённой на всей числовой прямой:
f(x)={ 1−(x+2)^2,   при x≤−2 
        −x/2,       при −2<x≤2 
        (x−2)^2+1,  при 2<x 
Требуется реализовать только функцию, решение не должно осуществлять операций ввода-вывода.
'''
def fx(x):
    if x <= -2:
        return 1-(x+2)**2
    elif x <= 2:
        return -x/2
    else:
        return (x-2)**2+1

def f311 ():
    x = float(input())
    print(fx(x))

#=================================================================================================
#                            3.1.2
#=================================================================================================
''' Напишите функцию modify_list(l), которая принимает на вход список целых чисел, удаляет из него 
все нечётные значения, а чётные нацело делит на два. 
Функция не должна ничего возвращать, требуется только изменение переданного списка
'''
def modify_list(l):
    ll,i = len(l),0
    while i < ll:
        if l[i]%2 == 0:
            l[i] = l[i]//2
            i += 1
        else:
            del l[i]
            ll -= 1
    return

def f312():
    lst = [int(i) for i in input().split()]
#    print(lst)
    print(modify_list(lst))
    print(lst)
    modify_list(lst)
    print(lst)

#=================================================================================================
#                            Main
#=================================================================================================

f312()



